{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "optional": false}}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "pool_size": [2], "padding": "valid", "strides": [2], "data_format": "channels_last"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "pool_size": [2], "padding": "valid", "strides": [2], "data_format": "channels_last"}}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": { "class_name": "DTypePolicy", "config": {"name": "float32"}}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}], "build_input_shape": [null, 256, 3]}}, "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "sequential/batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential/conv1d/kernel", "shape": [3, 3, 64], "dtype": "float32"}, {"name": "sequential/conv1d/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/conv1d_1/kernel", "shape": [3, 64, 128], "dtype": "float32"}, {"name": "sequential/conv1d_1/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential/dense_1/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "sequential/dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "sequential/lstm/lstm_cell/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "sequential/lstm/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "sequential/lstm/lstm_cell/bias", "shape": [256], "dtype": "float32"}]}]}